Autodesk.Revit.DB.ExternalService.SingleServerService.UnsetActiveServer(Autodesk.Revit.DB.Document)
Unset the active server for the particular document.
Remarks:
After unsetting the active server, the document will be using the
application-wide active server, if one was already set.
Note it is not possible to unset a server that acts as an application-wide
active server for a service. On the other hand, there should be no reason
to ever do so, for each and every registered service should have (ideally)
an active server set applicatiton-wide.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The operation is not allowed because the service is being executed.
Since:
2013

Autodesk.Revit.DB.ExternalService.SingleServerService.SetActiveServer(System.Guid,Autodesk.Revit.DB.Document)
Change the active server for a specific document.
Remarks:
Only one server per document can be set as active at any given time
in a single-server service. A document does not have to have an explicitly
set active server though - the application-wide active server would be
normally used when the service is executed for such a document.
Having an active server for a document overrules the active server
set for the application. That means if the service gets executed in
this particular document, the document-specific server will be used
instead of the application-wide one.
It is possible to set a server as active when another server is already active
for that service in this document. Making a server active will automatically
deactivate the server that was active before this call.
serverId:
Id of the server.
document:
The document for which the server is being set as active.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given Id is not of a server registered with the service.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The operation is not allowed because the service is being executed.
Since:
2013

Autodesk.Revit.DB.ExternalService.SingleServerService.SetActiveServer(System.Guid)
Set an active server applicable application-wide for the service.
Remarks:
Only one server can be active at any given time in a single-server service,
but it is possible that no server is active (unless the service is mandatory).
An application-wide active server gets executed when the service is invoked
in the scope of the entire application (i.e. without a specific document),
or if the service is executed in a document but the document does not have
an active server explicitly set.
It is possible to set a server as active when another server is already active
for that service. Making a server active will automatically deactivate the server
that was active before this call.
serverId:
Id of the application server.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given Id is not of a server registered with the service.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The operation is not allowed because the service is being executed.
Since:
2013

Autodesk.Revit.DB.ExternalService.SingleServerService.GetActiveServerId(Autodesk.Revit.DB.Document)
Returns the Id of the server currently associated with the given document for the service.
document:
The document for which the server is being set as active.
Returns:
The Guid of the active server, or an invalid Guid if there is no active server assigned.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ExternalService.SingleServerService.GetActiveServerId
Returns the Id of the currently active application-level server of the service.
Returns:
The GUID of the active server, or an invalid GUID if there is no active server assigned.
Since:
2013

Autodesk.Revit.DB.ExternalService.SingleServerService
This class represents a single-server service inside Revit application.
It is created when an instance of ISingleServerService is registered with Revit.
Since:
2013